import React from "react";
import { FaInstagram, FaTelegram, FaTwitter, FaEnvelope, FaSmileWink, FaPhone } from "react-icons/fa";
import Services from "./Services";

const Footer = () => {
  return (
    <>
      <Services />
      <div className="footer">
        <div className="row">
          <div className="news">
            <div className="formWrapper">
              <h4 className="font-weight-bold">
                : از اخبار و جدیدترین های ما با خبر شوید
              </h4>
              <form action="#" className="form">
                <button type="button" className="btn">
                  ارسال
                </button>
                <input type="text" />
              </form>
            </div>
            <div className="social-wrapper">
              <h4>: در شبکه های اجتماعی همراه ما باشید</h4>
              <div className="social">
                <a href="instagram">
                  <FaInstagram />
                </a>
                <a href="telegram">
                  <FaTelegram />
                </a>
                <a href="twitter">
                  <FaTwitter />
                </a>
              </div>
            </div>
          </div>

          <div className="infoStore">
            <h4 className="font-weight-bold">فروشگاه یو شاپ</h4>
            <p className="text">
              {" "}
              یو شاپ در زمینه فروشندگی انواع کالا به تازگی در این زمینه گام نهاده
              و سعی در فروش بهترین و جدیدترین محصولات می باشد و در تلاش
              است با سرویس دهی منظم و تضمینی اعم از بازگشت محصولات پس از 7 روز,
              تحویل محصول در اسرع وقت و پاسخگویی 24 ساعته به مشتریان سعی در جلب
              رضایت مشتریان خود دارد
            </p>
          </div>

          <div className="contactUs">
            <h4 className="font-weight-bold">تماس با ما</h4>
            <ul>
              <li>
                example@yahoo.com : <FaEnvelope className="listIcon" />
              </li>
              <li>
                021-00000000 : <FaPhone className="listIcon" />
              </li>
              <li>
                {" "}
                ما پشتیبان شماییم, تماس بگیرین{" "}
                <FaSmileWink className="listIcon" />
              </li>
            </ul>
          </div>
        </div>
        {/* SVG */}
        <svg
          viewBox="0 0 200 200"
          xmlns="http://www.w3.org/2000/svg"
          className="footerSvg1"
        >
          <path
            fill="#653aff"
            d="M39.7,-61C52.4,-53.7,64.2,-44.2,71.5,-31.6C78.8,-19.1,81.7,-3.5,80.4,12.2C79.2,27.9,73.9,43.7,63.6,54.5C53.3,65.3,38,71.3,21.9,77.3C5.8,83.3,-11.1,89.4,-25.5,85.7C-39.8,82,-51.6,68.5,-60.3,54.5C-68.9,40.5,-74.3,26,-77.8,10.4C-81.3,-5.2,-82.9,-21.9,-76.7,-34.9C-70.6,-48,-56.8,-57.4,-42.7,-64.1C-28.6,-70.8,-14.3,-74.7,-0.4,-74.1C13.5,-73.5,27,-68.3,39.7,-61Z"
            transform="translate(100 100)"
          />
        </svg>
        <svg
          viewBox="0 0 200 200"
          xmlns="http://www.w3.org/2000/svg"
          className="footerSvg2"
        >
          <path
            fill="#653aff"
            d="M39.7,-61C52.4,-53.7,64.2,-44.2,71.5,-31.6C78.8,-19.1,81.7,-3.5,80.4,12.2C79.2,27.9,73.9,43.7,63.6,54.5C53.3,65.3,38,71.3,21.9,77.3C5.8,83.3,-11.1,89.4,-25.5,85.7C-39.8,82,-51.6,68.5,-60.3,54.5C-68.9,40.5,-74.3,26,-77.8,10.4C-81.3,-5.2,-82.9,-21.9,-76.7,-34.9C-70.6,-48,-56.8,-57.4,-42.7,-64.1C-28.6,-70.8,-14.3,-74.7,-0.4,-74.1C13.5,-73.5,27,-68.3,39.7,-61Z"
            transform="translate(100 100)"
          />
        </svg>
        <svg
          viewBox="0 0 200 200"
          xmlns="http://www.w3.org/2000/svg"
          className="footerSvg3"
        >
          <path
            fill="#00ff9b"
            d="M39.7,-61C52.4,-53.7,64.2,-44.2,71.5,-31.6C78.8,-19.1,81.7,-3.5,80.4,12.2C79.2,27.9,73.9,43.7,63.6,54.5C53.3,65.3,38,71.3,21.9,77.3C5.8,83.3,-11.1,89.4,-25.5,85.7C-39.8,82,-51.6,68.5,-60.3,54.5C-68.9,40.5,-74.3,26,-77.8,10.4C-81.3,-5.2,-82.9,-21.9,-76.7,-34.9C-70.6,-48,-56.8,-57.4,-42.7,-64.1C-28.6,-70.8,-14.3,-74.7,-0.4,-74.1C13.5,-73.5,27,-68.3,39.7,-61Z"
            transform="translate(100 100)"
          />
        </svg>
        <svg
          viewBox="0 0 200 200"
          xmlns="http://www.w3.org/2000/svg"
          className="footerSvg4"
        >
          <path
            fill="#00ff9b"
            d="M39.7,-61C52.4,-53.7,64.2,-44.2,71.5,-31.6C78.8,-19.1,81.7,-3.5,80.4,12.2C79.2,27.9,73.9,43.7,63.6,54.5C53.3,65.3,38,71.3,21.9,77.3C5.8,83.3,-11.1,89.4,-25.5,85.7C-39.8,82,-51.6,68.5,-60.3,54.5C-68.9,40.5,-74.3,26,-77.8,10.4C-81.3,-5.2,-82.9,-21.9,-76.7,-34.9C-70.6,-48,-56.8,-57.4,-42.7,-64.1C-28.6,-70.8,-14.3,-74.7,-0.4,-74.1C13.5,-73.5,27,-68.3,39.7,-61Z"
            transform="translate(100 100)"
          />
        </svg>
        <svg
          viewBox="0 0 200 200"
          xmlns="http://www.w3.org/2000/svg"
          className="footerSvg5"
        >
          <path
            fill="#00ff9b"
            d="M39.7,-61C52.4,-53.7,64.2,-44.2,71.5,-31.6C78.8,-19.1,81.7,-3.5,80.4,12.2C79.2,27.9,73.9,43.7,63.6,54.5C53.3,65.3,38,71.3,21.9,77.3C5.8,83.3,-11.1,89.4,-25.5,85.7C-39.8,82,-51.6,68.5,-60.3,54.5C-68.9,40.5,-74.3,26,-77.8,10.4C-81.3,-5.2,-82.9,-21.9,-76.7,-34.9C-70.6,-48,-56.8,-57.4,-42.7,-64.1C-28.6,-70.8,-14.3,-74.7,-0.4,-74.1C13.5,-73.5,27,-68.3,39.7,-61Z"
            transform="translate(100 100)"
          />
        </svg>
        <svg
          viewBox="0 0 200 200"
          xmlns="http://www.w3.org/2000/svg"
          className="footerSvg6"
        >
          <path
            fill="#00ff9b"
            d="M39.7,-61C52.4,-53.7,64.2,-44.2,71.5,-31.6C78.8,-19.1,81.7,-3.5,80.4,12.2C79.2,27.9,73.9,43.7,63.6,54.5C53.3,65.3,38,71.3,21.9,77.3C5.8,83.3,-11.1,89.4,-25.5,85.7C-39.8,82,-51.6,68.5,-60.3,54.5C-68.9,40.5,-74.3,26,-77.8,10.4C-81.3,-5.2,-82.9,-21.9,-76.7,-34.9C-70.6,-48,-56.8,-57.4,-42.7,-64.1C-28.6,-70.8,-14.3,-74.7,-0.4,-74.1C13.5,-73.5,27,-68.3,39.7,-61Z"
            transform="translate(100 100)"
          />
        </svg>
        <div className="law">
          <p className="siteLaw">
            کلیه حقوق این سایت متعلق به یو شاپ می باشد
          </p>
        </div>
      </div>
    </>
  );
};

export default Footer;
